app/views/welcome/profile.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
---

  <% @user.articles.each do |article| %>