app/controllers/articles_controller.rb

  def index
    @articles = current_user.articles.all
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]

  def create
    @article = Article.new(article_params)
    @article.user = current_user

    if @article.save
---
INSERT INTO "articles" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Rohan's second"], ["content", "My second data"], ["user_id", 1], ["created_at", "2015-10-29 19:22:23.998320"], ["updated_at", "2015-10-29 19:22:23.998320"]]

  def update
    @article = Article.find(params[:id])
    @article.user = current_user

    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["content", "lololol"], ["updated_at", "2015-11-01 07:23:09.422592"], ["id", 1]]