app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("content", "article_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "by taneja"], ["article_id", 6], ["user_id", 4], ["created_at", "2015-11-01 08:02:41.499183"], ["updated_at", "2015-11-01 08:02:41.499183"]]
---
  def create
   @article = Article.find(params[:article_id])
   @comment = @article.comments.new(comment_params)
   @comment.user = current_user
   @comment.save